#include <iostream>
using namespace std;
int main()
{
    // 数组特点，存放在一串连续内存空间，每个元素都是相同数据类型
    // 定义方式
    // 1,数据类型 数组名[数组长度]；
    // 2,数据类型 数组名[数组长度]={值1，值2...};
    // 3,数据类型 数组名[ ]={值1,值2...};

    // 第一种举例,注意下标从零开始
    //  int arr[5];
    //  arr[0] = 10;
    //  arr[1] = 20;
    //  arr[2] = 30;
    //  arr[3] = 40;
    //  arr[4] = 50;
    // 访问数组中元素
    // cout << arr[0] << endl;

    // 第二种定义方式;如果不赋值默认是0
    // int arr[ 5 ]={1,2,3,4,5};
    // 利用循环输出数组
    //  for(int i = 0 ; i < 5 ; i++)
    //  {
    //      cout << arr[i] << endl;
    //  }

    // 第三种定义方式,必须有元素
    int arr[] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9};
    // for循环输出
    for (int i = 0; i < 10; i++)
    {
        cout << arr[i] << endl;
    }

    system("pause");
    return 0;
}